awalong133/Hote/EIDE/.pack/Puya/PY32F0xx_DFP.1.2.15/CMSIS/SVD/PY32F033xx.svd
<?xml version="1.0" encoding="utf-8" standalone="no"?>
<device schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" noNamespaceSchemaLocation="CMSIS-SVD.xsd">
  <vendor>Puya</vendor>
  <vendorID>Puya</vendorID>
  <name>PY32F033xx</name>
  <series>PY32F0</series>
  <version>1.0.0</version>
  <description>Arm 32-bit Cortex-M0+ Microcontroller based device, CPU clock up to 48 MHz.</description>
  <cpu>
    <name>CM0+</name>
    <revision>r0p1</revision>
    <endian>little</endian>
    <mpuPresent>false</mpuPresent>
    <fpuPresent>false</fpuPresent>
    <nvicPrioBits>4</nvicPrioBits>
    <vendorSystickConfig>false</vendorSystickConfig>
  </cpu>
  <addressUnitBits>8</addressUnitBits>
  <width>32</width>
  <size>32</size>
  <access>read-write</access>
  <resetValue>0x0</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <peripherals>
    <peripheral>
      <name>ADC</name>
      <description>Analog to Digital Converter</description>
      <baseAddress>0x40012400</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>ADC_COMP</name>
        <description>ADC and COMP Interrupt through EXTI Lines 17 and 18</description>
        <value>12</value>
      </interrupt>
      <registers>
        <register>
          <name>ISR</name>
          <description>ADC interrupt and status register</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>ADRDY</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EOSMP</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EOC</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EOS</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>OVR</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>JEOC</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>JEOS</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>AWD</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>EOCAL</name>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IER</name>
          <description>ADC interrupt enable register</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>ADRDYIE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EOSMPIE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EOCIE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EOSIE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>OVRIE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>JEOCIE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>JEOSIE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>AWDIE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>EOCALIE</name>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CR</name>
          <description>ADC control register</description>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>ADEN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ADDIS</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ADSTART</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>JADSTART</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ADSTP</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>JADSTP</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>RSTCAL</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>ADCAL</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGR</name>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>DMAEN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>DMACFG</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RES</name>
              <bitRange>[4:3]</bitRange>
            </field>
            <field>
              <name>EXTSEL</name>
              <bitRange>[8:5]</bitRange>
            </field>
            <field>
              <name>EXTEN</name>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>OVRMOD</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CONT</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>AUTDLY</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ALIGN</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>DISCEN</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>DISCNUM</name>
              <bitRange>[19:17]</bitRange>
            </field>
            <field>
              <name>JDISCEN</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>AWDSGL</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>AWDEN</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>JAWDEN</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>JAUTO</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>AWDCH</name>
              <bitRange>[29:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGR2</name>
          <description>ADC configuration register 2</description>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>CALNUM</name>
              <bitRange>[30:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPR1</name>
          <description>ADC sampling time register 1</description>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>SMP0</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>SMP1</name>
              <bitRange>[5:3]</bitRange>
            </field>
            <field>
              <name>SMP2</name>
              <bitRange>[8:6]</bitRange>
            </field>
            <field>
              <name>SMP3</name>
              <bitRange>[11:9]</bitRange>
            </field>
            <field>
              <name>SMP4</name>
              <bitRange>[14:12]</bitRange>
            </field>
            <field>
              <name>SMP5</name>
              <bitRange>[17:15]</bitRange>
            </field>
            <field>
              <name>SMP6</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>SMP7</name>
              <bitRange>[23:21]</bitRange>
            </field>
            <field>
              <name>SMP8</name>
              <bitRange>[26:24]</bitRange>
            </field>
            <field>
              <name>SMP9</name>
              <bitRange>[29:27]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPR2</name>
          <addressOffset>0x18</addressOffset>
          <fields>
            <field>
              <name>SMP10</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>SMP11</name>
              <bitRange>[5:3]</bitRange>
            </field>
            <field>
              <name>SMP12</name>
              <bitRange>[8:6]</bitRange>
            </field>
            <field>
              <name>SMP13</name>
              <bitRange>[11:9]</bitRange>
            </field>
            <field>
              <name>SMP14</name>
              <bitRange>[14:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TR</name>
          <addressOffset>0x24</addressOffset>
          <fields>
            <field>
              <name>LT</name>
              <bitRange>[11:0]</bitRange>
            </field>
            <field>
              <name>AWDFILT</name>
              <bitRange>[14:12]</bitRange>
            </field>
            <field>
              <name>HT</name>
              <bitRange>[27:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SQR1</name>
          <addressOffset>0x30</addressOffset>
          <fields>
            <field>
              <name>L</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>SQ1</name>
              <bitRange>[9:6]</bitRange>
            </field>
            <field>
              <name>SQ2</name>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>SQ3</name>
              <bitRange>[21:18]</bitRange>
            </field>
            <field>
              <name>SQ4</name>
              <bitRange>[27:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SQR2</name>
          <addressOffset>0x34</addressOffset>
          <fields>
            <field>
              <name>SQ5</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>SQ6</name>
              <bitRange>[9:6]</bitRange>
            </field>
            <field>
              <name>SQ7</name>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>SQ8</name>
              <bitRange>[21:18]</bitRange>
            </field>
            <field>
              <name>SQ9</name>
              <bitRange>[27:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SQR3</name>
          <addressOffset>0x38</addressOffset>
          <fields>
            <field>
              <name>SQ10</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>SQ11</name>
              <bitRange>[9:6]</bitRange>
            </field>
            <field>
              <name>SQ12</name>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>SQ13</name>
              <bitRange>[21:18]</bitRange>
            </field>
            <field>
              <name>SQ14</name>
              <bitRange>[27:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SQR4</name>
          <addressOffset>0x3C</addressOffset>
          <fields>
            <field>
              <name>SQ15</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>SQ16</name>
              <bitRange>[9:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DR</name>
          <description>ADC group regular data register</description>
          <addressOffset>0x40</addressOffset>
          <fields>
            <field>
              <name>RDATA</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JSQR</name>
          <addressOffset>0x4C</addressOffset>
          <fields>
            <field>
              <name>JL</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>JEXTSEL</name>
              <bitRange>[5:2]</bitRange>
            </field>
            <field>
              <name>JEXTEN</name>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>JSQ1</name>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>JSQ2</name>
              <bitRange>[17:14]</bitRange>
            </field>
            <field>
              <name>JSQ3</name>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>JSQ4</name>
              <bitRange>[29:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>JDR1</name>
          <addressOffset>0x80</addressOffset>
          <fields>
            <field>
              <name>JDATA</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JDR2</name>
          <addressOffset>0x84</addressOffset>
          <fields>
            <field>
              <name>JDATA</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JDR3</name>
          <addressOffset>0x88</addressOffset>
          <fields>
            <field>
              <name>JDATA</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JDR4</name>
          <addressOffset>0x8C</addressOffset>
          <fields>
            <field>
              <name>JDATA</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CALFACT</name>
          <addressOffset>0xB4</addressOffset>
          <fields>
            <field>
              <name>WCALFACT</name>
              <bitRange>[8:0]</bitRange>
            </field>
            <field>
              <name>FACTSEL</name>
              <bitRange>[13:9]</bitRange>
            </field>
            <field>
              <name>WRVLD</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>RDVLD</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>OFFSUC</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>CAPSUC</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>RCALFACT</name>
              <bitRange>[31:23]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR</name>
          <description>ADC common configuration register</description>
          <addressOffset>0x308</addressOffset>
          <fields>
            <field>
              <name>CKMODE</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>PRESC</name>
              <bitRange>[21:18]</bitRange>
            </field>
            <field>
              <name>VREFEN</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>TSEN</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>PWR_MODE</name>
              <bitRange>[27:25]</bitRange>
            </field>
            <field>
              <name>VSENSESEL</name>
              <bitRange>[28:28]</bitRange>
            </field>
          </fields>
        </register>
