awalong133/Hote/EIDE/.pack/Puya/PY32F0xx_DFP.1.2.15/CMSIS/SVD/PY32F033xx.svd
        <register>
          <name>CCR3</name>
          <description>DMA channel configuration register(DMA_CCR)</description>
          <addressOffset>0x30</addressOffset>
          <fields>
            <field>
              <name>EN</name>
              <description>Channel Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TCIE</name>
              <description>Transfer Complete Interrupt Enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>BTCIE</name>
              <description>Block Transfer Complete Interrupt Enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>HBTIE</name>
              <description>Half Block Transfer Complete Interrupt Enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TEIE</name>
              <description>Transfer Error Interrupt Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>DIR</name>
              <description>Data Transfer Direction</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CIRC</name>
              <description>Circular Mode</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TRANST</name>
              <description>Transfer Type</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>PINC</name>
              <description>Peripheral Increment Mode</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>MINC</name>
              <description>Memory Increment Mode</description>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>PSIZE</name>
              <description>Peripheral Size</description>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>MSIZE</name>
              <description>Memory Size</description>
              <bitRange>[15:14]</bitRange>
            </field>
            <field>
              <name>PL</name>
              <description>Priority Level</description>
              <bitRange>[18:16]</bitRange>
            </field>
            <field>
              <name>MEM2MEM</name>
              <description>Memory-to-memory Mode</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>PNORLD</name>
              <description>Peripheral No Reload</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>MNORLD</name>
              <description>Memory No Reload</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>BTCSUSP</name>
              <description>Suspend in Block Transfer Complete Interrupt</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>M2MARB</name>
              <description>Memory-to-memory Mode Arbitration</description>
              <bitRange>[23:23]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNDTR3</name>
          <description>DMA channel 3 number of dataregister</description>
          <addressOffset>0x34</addressOffset>
          <fields>
            <field>
              <name>NDT</name>
              <description>Number of Data to Transfer</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CPAR3</name>
          <description>DMA channel 3 peripheral addressregister</description>
          <addressOffset>0x38</addressOffset>
          <fields>
            <field>
              <name>PA</name>
              <description>Peripheral Address</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CMAR3</name>
          <description>DMA channel 3 memory addressregister</description>
          <addressOffset>0x3C</addressOffset>
          <fields>
            <field>
              <name>MA</name>
              <description>Memory Address</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCCFGR3</name>
          <addressOffset>0x40</addressOffset>
          <fields>
            <field>
              <name>NBT</name>
              <description>Number of Block to Loop Transfer</description>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>NDTL</name>
              <description>Number of Data to Transfer Last Loop</description>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>EXTI</name>
      <description>External interrupt/eventcontroller</description>
      <baseAddress>0x40021800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>PVD</name>
        <description>PVD Interrupt through EXTI Lines 16</description>
        <value>1</value>
      </interrupt>
      <interrupt>
        <name>EXTI0_1</name>
        <description>EXTI Line 0 and 1 Interrupt</description>
        <value>5</value>
      </interrupt>
      <interrupt>
        <name>EXTI2_3</name>
        <description>EXTI Line 2 and 3 Interrupt</description>
        <value>6</value>
      </interrupt>
      <interrupt>
        <name>EXTI4_15</name>
        <description>EXTI Line 4 to 15 Interrupt</description>
        <value>7</value>
      </interrupt>
      <registers>
        <register>
          <name>RTSR</name>
          <description>EXTI rising trigger selectionregister</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>RT0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RT1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RT2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RT3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RT4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RT5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>RT6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RT7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>RT8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>RT9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>RT10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>RT11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>RT12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>RT13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>RT14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>RT15</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>RT16</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>RT17</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>RT18</name>
              <bitRange>[18:18]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FTSR</name>
          <description>EXTI falling trigger selectionregister</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>FT0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>FT1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>FT2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>FT3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>FT4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>FT5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>FT6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>FT7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>FT8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>FT9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>FT10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>FT11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>FT12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>FT13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FT14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>FT15</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>FT16</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>FT17</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>FT18</name>
              <bitRange>[18:18]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SWIER</name>
          <description>EXTI software interrupt eventregister</description>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>SWIE0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SWIE1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SWIE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SWIE3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SWIE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SWIE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SWIE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SWIE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SWIE8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SWIE9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SWIE10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>SWIE11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SWIE12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SWIE13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>SWIE14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>SWIE15</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>SWIE16</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>SWIE17</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>SWIE18</name>
              <bitRange>[18:18]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PR</name>
          <description>EXTI pendingregister</description>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>PR0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PR1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PR2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PR3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>PR4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PR5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>PR6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>PR7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>PR8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>PR9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>PR10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>PR11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>PR12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>PR13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>PR14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>PR15</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>PR16</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>PR17</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>PR18</name>
              <bitRange>[18:18]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IOSEL1</name>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>EXTI0SEL</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>EXTI1SEL</name>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>EXTI2SEL</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>EXTI3SEL</name>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>EXTI4SEL</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>EXTI5SEL</name>
              <bitRange>[21:20]</bitRange>
            </field>
            <field>
              <name>EXTI6SEL</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>EXTI7SEL</name>
              <bitRange>[29:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IOSEL2</name>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>EXTI8SEL</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>EXTI9SEL</name>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>EXTI10SEL</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>EXTI11SEL</name>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>EXTI12SEL</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>EXTI13SEL</name>
              <bitRange>[21:20]</bitRange>
            </field>
            <field>
              <name>EXTI14SEL</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>EXTI15SEL</name>
              <bitRange>[29:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IMR</name>
          <description>EXTI CPU wakeup with interrupt maskregister</description>
          <addressOffset>0x18</addressOffset>
          <fields>
            <field>
              <name>IM0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>IM1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>IM2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>IM3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>IM4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>IM5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>IM6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>IM7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>IM8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>IM9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>IM10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>IM11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>IM12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>IM13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>IM14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>IM15</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>IM16</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>IM17</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>IM18</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>IM20</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>IM22</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>IM24</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>IM25</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>IM27</name>
              <bitRange>[27:27]</bitRange>
            </field>
          </fields>
        </register>
