awalong133/Hote/EIDE/.pack/Puya/PY32F0xx_DFP.1.2.15/CMSIS/SVD/PY32F033xx.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="UART1">
      <name>UART2</name>
      <baseAddress>0x40004C00</baseAddress>
    </peripheral>
    <peripheral>
      <name>USART1</name>
      <description>Universal synchronous asynchronous receivertransmitter</description>
      <groupName>USART</groupName>
      <baseAddress>0x40013800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>USART1</name>
        <description>USART1 global Interrupt</description>
        <value>27</value>
      </interrupt>
      <registers>
        <register>
          <name>SR</name>
          <description>Status register</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>PE</name>
              <description>Parity error</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FE</name>
              <description>Framing error</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>NE</name>
              <description>Noise error flag</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ORE</name>
              <description>overrun error</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>IDLE</name>
              <description>idle</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RXNE</name>
              <description>Read data register not empty</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TC</name>
              <description>Transmission complete</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TXE</name>
              <description>Transmit data register empty</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>LBD</name>
              <description>LIN break detection flag</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CTS</name>
              <description>cts flag</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ABRF</name>
              <description>auto baud rate flag</description>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ABRE</name>
              <description>auto baud rateerror</description>
              <bitRange>[11:11]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ABRRQ</name>
              <description>auto baud rate req</description>
              <bitRange>[12:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RTOF</name>
              <description>rto flag</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>TXPE</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>RXBUSY</name>
              <bitRange>[21:21]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TXBUSY</name>
              <bitRange>[22:22]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DR</name>
          <description>Data register</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>DR</name>
              <description>dr</description>
              <bitRange>[8:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>BRR</name>
          <description>Baud rate register</description>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>DIV_FRACTION</name>
              <description>DIV_Fraction</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>DIV_MANTISSA</name>
              <description>DIV_Mantissa</description>
              <bitRange>[15:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CR1</name>
          <description>Control register 1</description>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>SBK</name>
              <description>Send break</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RWU</name>
              <description>Receiver wakeup</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RE</name>
              <description>Receiver enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TE</name>
              <description>Transmitter enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>IDLEIE</name>
              <description>IDLE interrupt enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RXNEIE</name>
              <description>RXNE interrupt enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TCIE</name>
              <description>send complete int enable</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TXEIE</name>
              <description>txe</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>PEIE</name>
              <description>PE interrupt enable</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>PS</name>
              <description>Parity selection</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>PCE</name>
              <description>Parity control enable</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>WAKE</name>
              <description>Wakeup method</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>M</name>
              <description>word length</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>UE</name>
              <description>uesart enable</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>MSBFIRST</name>
              <description>msbfirst</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>SWAP</name>
              <description>swap</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>DATAINV</name>
              <description>data inverse</description>
              <bitRange>[27:27]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CR2</name>
          <description>Control register 2</description>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>ADD</name>
              <description>mute addr</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>LBDL</name>
              <description>LIN break detection length</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>LBDIE</name>
              <description>lin break enable</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>LBCL</name>
              <description>lbcl</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CPHA</name>
              <description>cpha</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CPOL</name>
              <description>cpol</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CLKEN</name>
              <description>clk en</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>STOP</name>
              <description>stop bit</description>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>LINEN</name>
              <description>lin enable</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>RTOEN</name>
              <description>Receiver timeout enable</description>
              <bitRange>[25:25]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CR3</name>
          <description>Control register 3</description>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>EIE</name>
              <description>error int enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>HDSEL</name>
              <description>hdsel</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>DMAR</name>
              <description>dma rx enable</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>DMAT</name>
              <description>dma tx enable</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>RTSE</name>
              <description>rts enable</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CTSE</name>
              <description>cts enable</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CTSIE</name>
              <description>cts int enable</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>OVER8</name>
              <description>oversampling</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ABREN</name>
              <description>autobaud enable</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>ABRMOD</name>
              <description>auto baud mod</description>
              <bitRange>[14:13]</bitRange>
            </field>
            <field>
              <name>RTOIE</name>
              <description>rto int enable</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>TXLSEIE</name>
              <description>tx register empty int enable</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RTOR</name>
          <addressOffset>0x1C</addressOffset>
          <fields>
            <field>
              <name>RTO</name>
              <description>receive timeout</description>
              <bitRange>[23:0]</bitRange>
            </field>
          </fields>
        </register>
